In [10]:
import pandas as pd
import numpy as np

In [17]:
salary_train = pd.read_csv(r"C:\Users\SALLA BHAVANA\Desktop\data science\naive baiyes Classifier\Datasets_Naive Bayes\SalaryData_Train.csv")

In [39]:
salary_train.isnull().sum()

age              0
workclass        0
education        0
educationno      0
maritalstatus    0
occupation       0
relationship     0
race             0
sex              0
capitalgain      0
capitalloss      0
hoursperweek     0
native           0
Salary           0
dtype: int64

In [34]:
salary_train= salary_train.drop_duplicates()
salary_train.shape

(26903, 14)

In [35]:
salary_train1=pd.get_dummies(salary_train)

In [36]:
salary_train1.head()

,age,educationno,capitalgain,capitalloss,hoursperweek,workclass_ Federal-gov,workclass_ Local-gov,workclass_ Private,workclass_ Self-emp-inc,workclass_ Self-emp-not-inc,...,native_ Scotland,native_ South,native_ Taiwan,native_ Thailand,native_ Trinadad&Tobago,native_ United-States,native_ Vietnam,native_ Yugoslavia,Salary_ <=50K,Salary_ >50K
0,39,13,2174,0,40,0,0,0,0,0,...,0,0,0,0,0,1,0,0,1,0
1,50,13,0,0,13,0,0,0,0,1,...,0,0,0,0,0,1,0,0,1,0
2,38,9,0,0,40,0,0,1,0,0,...,0,0,0,0,0,1,0,0,1,0
3,53,7,0,0,40,0,0,1,0,0,...,0,0,0,0,0,1,0,0,1,0
4,28,13,0,0,40,0,0,1,0,0,...,0,0,0,0,0,0,0,0,1,0

In [23]:
salary_test = pd.read_csv(r"C:\Users\SALLA BHAVANA\Desktop\data science\naive baiyes Classifier\Datasets_Naive Bayes\SalaryData_Test.csv")

In [37]:
salary_test=salary_test.drop_duplicates()
salary_test.shape

(14130, 14)

In [51]:
salary_test1=pd.get_dummies(salary_test.iloc[:,:-1])
salary_test1.head()

,age,educationno,capitalgain,capitalloss,hoursperweek,workclass_ Federal-gov,workclass_ Local-gov,workclass_ Private,workclass_ Self-emp-inc,workclass_ Self-emp-not-inc,...,native_ Portugal,native_ Puerto-Rico,native_ Scotland,native_ South,native_ Taiwan,native_ Thailand,native_ Trinadad&Tobago,native_ United-States,native_ Vietnam,native_ Yugoslavia
0,25,7,0,0,40,0,0,1,0,0,...,0,0,0,0,0,0,0,1,0,0
1,38,9,0,0,50,0,0,1,0,0,...,0,0,0,0,0,0,0,1,0,0
2,28,12,0,0,40,0,1,0,0,0,...,0,0,0,0,0,0,0,1,0,0
3,44,10,7688,0,40,0,0,1,0,0,...,0,0,0,0,0,0,0,1,0,0
4,34,6,0,0,30,0,0,1,0,0,...,0,0,0,0,0,0,0,1,0,0

In [52]:
#bayes algorithm w.r.t salary column

In [53]:
from sklearn.naive_bayes import MultinomialNB as MB

In [54]:
classifier_mb = MB()

In [73]:
#test data set 
classifier_mb.fit(salary_test1, salary_test.Salary)

MultinomialNB()

In [74]:
test_pred_m = classifier_mb.predict(salary_test1)
test_pred_m

array([' <=50K', ' <=50K', ' <=50K', ..., ' <=50K', ' >50K', ' <=50K'],
      dtype='<U6')

In [75]:
accuracy_test_m = np.mean(test_pred_m == salary_test.Salary)
accuracy_test_m

0.7733899504600141

In [76]:
pd.crosstab(test_pred_m,salary_test.Salary)

Salary   <=50K   >50K
row_0
 <=50K   10151   2733
 >50K      469    777

In [77]:
#tain dataset 
classifier_mb.fit(salary_train1, salary_train.Salary)

MultinomialNB()

In [78]:
train_pred_m = classifier_mb.predict(salary_train1)
train_pred_m

array([' >50K', ' <=50K', ' <=50K', ..., ' <=50K', ' <=50K', ' >50K'],
      dtype='<U6')

In [81]:
accuracy_train_m = np.mean(train_pred_m == salary_train.Salary)
accuracy_train_m

0.7683158012117608

In [82]:
pd.crosstab(train_pred_m,salary_train.Salary)

Salary   <=50K   >50K
row_0
 <=50K   19088   5298
 >50K      935   1582

In [88]:
#  baiyes with laplace w.r.t salary column
classifier_mb_lap = MB(alpha=0.25)

In [93]:
#test data set 
classifier_mb_lap.fit(salary_test1, salary_test.Salary)
test_pred_m = classifier_mb_lap.predict(salary_test1)
test_pred_m

array([' <=50K', ' <=50K', ' <=50K', ..., ' <=50K', ' >50K', ' <=50K'],
      dtype='<U6')

In [94]:
accuracy_test_m = np.mean(test_pred_m == salary_test.Salary)
accuracy_test_m

0.7733899504600141

In [95]:
pd.crosstab(test_pred_m,salary_test.Salary)

Salary   <=50K   >50K
row_0
 <=50K   10151   2733
 >50K      469    777

In [96]:
#tain dataset 
classifier_mb_lap.fit(salary_train1, salary_train.Salary)
train_pred_m = classifier_mb_lap.predict(salary_train1)
train_pred_m

array([' >50K', ' <=50K', ' <=50K', ..., ' <=50K', ' <=50K', ' >50K'],
      dtype='<U6')

In [97]:
accuracy_train_m = np.mean(train_pred_m == salary_train.Salary)
accuracy_train_m

0.7683158012117608

In [98]:
pd.crosstab(train_pred_m,salary_train.Salary)

Salary   <=50K   >50K
row_0
 <=50K   19088   5298
 >50K      935   1582

In [99]:
#alpha 0.75
classifier_mb_lap = MB(alpha=0.75)

In [100]:
#test data set 
classifier_mb_lap.fit(salary_test1, salary_test.Salary)
test_pred_m = classifier_mb_lap.predict(salary_test1)
test_pred_m

array([' <=50K', ' <=50K', ' <=50K', ..., ' <=50K', ' >50K', ' <=50K'],
      dtype='<U6')

In [101]:
accuracy_test_m = np.mean(test_pred_m == salary_test.Salary)
accuracy_test_m

0.7733899504600141

In [102]:
pd.crosstab(test_pred_m,salary_test.Salary)

Salary   <=50K   >50K
row_0
 <=50K   10151   2733
 >50K      469    777

In [103]:
#tain dataset 
classifier_mb_lap.fit(salary_train1, salary_train.Salary)
train_pred_m = classifier_mb_lap.predict(salary_train1)
train_pred_m

array([' >50K', ' <=50K', ' <=50K', ..., ' <=50K', ' <=50K', ' >50K'],
      dtype='<U6')

In [104]:
accuracy_train_m = np.mean(train_pred_m == salary_train.Salary)
accuracy_train_m

0.7683158012117608

In [105]:
pd.crosstab(train_pred_m,salary_train.Salary)

Salary   <=50K   >50K
row_0
 <=50K   19088   5298
 >50K      935   1582